#include <iostream>
using namespace std;
// 作用：用于表达式的比较，并返回一个真值或假值
/*
|   运算符   |   术语   |   示例   |   结果   |
| ---------- | -------- | -------- | -------- |
| ==         | 相等于   | 4 == 3   | 0        |
| !=         | 不等于   | 4 != 3   | 1        |
| <          | 小于     | 4 < 3    | 0        |
| >          | 大于     | 4 > 3    | 1        |
| <=         | 小于等于 | 4 <= 3   | 0        |
| >=         | 大于等于 | 4 >= 1   | 1        |
*/
//“真”用除0以外的数字来表示， “假”用数字“0”来表示。
int main()
{
	int a = 10;
	int b = 20;
	cout << (a == b) << endl; // 0
	cout << (a != b) << endl; // 1
	cout << (a < b) << endl;  // 1
	cout << (a > b) << endl;  // 0
	cout << (a <= b) << endl; // 1
	cout << (a >= b) << endl; // 0
	system("pause");
	return 0;
}