//二维数组定义的四种方式：
//1.数据类型  数组名[行数][列数]; 
//2.数据类型  数组名[行数][列数] = { {数据1，数据2 } ，{数据3，数据4 } }; 
//3.数据类型  数组名[行数][列数] = { 数据1，数据2，数据3，数据4 }; 
//4.数据类型  数组名[][列数] = { 数据1，数据2，数据3，数据4 }; 
#include<iostream>
using namespace std;
int main()
{
	int arr[6][6] =
	{
		{6,6,6,6,6,6},
		{6,6,6,6,6,6},
		{6,6,6,6,6,6},
		{6,6,6,6,6,6},
		{6,6,6,6,6,6},
		{6,6,6,6,6,6},
	};
	for (int i = 0; i < 6; i++)
	{
		for (int j = 0; j < 6; j++)
		{
			cout << arr[i][j] << " ";
		}
		cout << endl;
	}
	system("pause");
	return 0;
}